In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('car_sales.csv')
df

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
0,2022-08-01,Monica Moore MD,Mary Butler,Nissan,Altima,2018,15983,0.070495,1126.73
1,2023-03-15,Roberto Rose,Richard Pierce,Nissan,F-150,2016,38474,0.134439,5172.40
2,2023-04-29,Ashley Ramos,Sandra Moore,Ford,Civic,2016,33340,0.114536,3818.63
3,2022-09-04,Patrick Harris,Johnny Scott,Ford,Altima,2013,41937,0.092191,3866.20
4,2022-06-16,Eric Lopez,Vanessa Jones,Honda,Silverado,2022,20256,0.113490,2298.85
...,...,...,...,...,...,...,...,...,...
94,2023-01-23,Donald Guerra,John Goodwin,Ford,Altima,2020,25964,0.098219,2550.15
95,2023-03-13,Alyssa Boyd,James Turner,Nissan,F-150,2016,10872,0.109547,1190.99
96,2022-12-31,Ryan Barnes,Mary Wong,Toyota,Silverado,2018,17650,0.105740,1866.32
97,2022-12-29,Megan Kaiser,Christopher Alexander,Ford,Civic,2013,25256,0.055621,1404.76
98,2023-04-16,Michael Jordan,Thomas Blankenship,Chevrolet,Altima,2014,31462,0.103951,3270.51

In [4]:
df.head()

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
0,2022-08-01,Monica Moore MD,Mary Butler,Nissan,Altima,2018,15983,0.070495,1126.73
1,2023-03-15,Roberto Rose,Richard Pierce,Nissan,F-150,2016,38474,0.134439,5172.40
2,2023-04-29,Ashley Ramos,Sandra Moore,Ford,Civic,2016,33340,0.114536,3818.63
3,2022-09-04,Patrick Harris,Johnny Scott,Ford,Altima,2013,41937,0.092191,3866.20
4,2022-06-16,Eric Lopez,Vanessa Jones,Honda,Silverado,2022,20256,0.113490,2298.85

In [5]:
df.tail()

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
94,2023-01-23,Donald Guerra,John Goodwin,Ford,Altima,2020,25964,0.098219,2550.15
95,2023-03-13,Alyssa Boyd,James Turner,Nissan,F-150,2016,10872,0.109547,1190.99
96,2022-12-31,Ryan Barnes,Mary Wong,Toyota,Silverado,2018,17650,0.105740,1866.32
97,2022-12-29,Megan Kaiser,Christopher Alexander,Ford,Civic,2013,25256,0.055621,1404.76
98,2023-04-16,Michael Jordan,Thomas Blankenship,Chevrolet,Altima,2014,31462,0.103951,3270.51

In [6]:
df["Car Make"]

0        Nissan
1        Nissan
2          Ford
3          Ford
4         Honda
        ...
94         Ford
95       Nissan
96       Toyota
97         Ford
98    Chevrolet
Name: Car Make, Length: 99, dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               99 non-null     object
 1   Salesperson        99 non-null     object
 2   Customer Name      99 non-null     object
 3   Car Make           99 non-null     object
 4   Car Model          99 non-null     object
 5   Car Year           99 non-null     int64
 6   Sale Price         99 non-null     int64
 7   Commission Rate    99 non-null     float64
 8   Commission Earned  99 non-null     float64
dtypes: float64(2), int64(2), object(5)
memory usage: 7.1+ KB

In [8]:
df.describe()

          Car Year    Sale Price  Commission Rate  Commission Earned
count    99.000000     99.000000        99.000000          99.000000
mean   2016.161616  28622.989899         0.104150        2984.722323
std       3.616027  10867.683713         0.027091        1415.463346
min    2010.000000  10313.000000         0.051853         804.140000
25%    2013.000000  18382.000000         0.084937        1920.225000
50%    2016.000000  28160.000000         0.102855        2720.130000
75%    2019.000000  36864.500000         0.124378        3807.860000
max    2022.000000  48916.000000         0.149926        6678.720000